{
  "metadata": {
    "document_id": "129435_sanitized",
    "title": "WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION",
    "document_type": "Wholesale Power Contract",
    "jurisdiction": "US-CO",
    "governing_law": "US-CO",
    "industry": "Power",
    "effective_date": "2045-01-01 00:00:00",
    "execution_date": null,
    "termination_date": null,
    "parties": [
      {
        "name": "TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC.",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Basin Electric Power Cooperative",
        "role": "Seller",
        "jurisdiction": "US-ND",
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Tri-State Generation and Transmission Association, Inc.",
        "role": "Seller",
        "jurisdiction": "US-ND",
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "WPC",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "WPC",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "WPC",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "-",
        "role": "Seller",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "-",
        "role": "Seller",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "-",
        "role": "Seller",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Utility Planning",
        "role": "Seller",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Energy Markets",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "WPC",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Basin Electric Power Cooperative",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      },
      {
        "name": "Tri-State Generation and Transmission Association, Inc.",
        "role": "Other",
        "jurisdiction": null,
        "address": null,
        "entity_type": "Cooperative Corporation"
      }
    ],
    "source_file": "data/129435_sanitized.xml",
    "source_format": "XML",
    "processing_date": "2025-08-19 00:00:37.342691"
  },
  "sections": [
    {
      "id": "3",
      "title": "Amount Of Sale And Delivery Points",
      "text": "1. Amount of Sale and Delivery Points. Seller shall sell and deliver to Tri-State and Tri- State shall purchase and receive from Seller the daily and hourly fixed scheduled quantities of electric power and energy at the Contract Rate of Delivery (“CROD”) for the given months of the year at the Points of Delivery in the Western Interconnection as set forth in Exhibits A and B attached herein and made part of this Agreement. 1 th A. The Parties may mutually agree to change the Points of Delivery for either Exhibit A or Exhibit B deliveries. With respect to Exhibit B deliveries, the sum of Seller’s deliveries to the Ault 230 kV and Story 230 kV busses for a given hour shall be equal to the amount shown in Exhibit B for that hour. 2. Electric Characteristics. A. Firm electric power and energy to be furnished hereunder shall be alternating current, three-phase, sixty (60) cycle. B. Contingency reserves, including operating, spinning and frequency responsive, shall be included with this purchase of electric power and energy. C. Scheduling practices shall comply with the policies of the applicable regional reliability organization(s), balancing area authority, and transmission provider’s open access transmission tariff(s), having such jurisdiction. 3. Transmission Service. A. Seller shall bear the sole responsibility to obtain and pay all costs of transmission of electric power and energy from Seller’s generation and purchased power resources to the Points of Delivery specified in Exhibit A and Exhibit B. This shall include, but not be limited to, losses and ancillary service charges. B. Tri-State shall have the sole responsibility to obtain and pay all costs of transmission service beyond the Points of Delivery. 4. Rate. A. Tri-State shall pay Seller for all electric power and energy furnished hereunder at the Seller’s Class A Member rate for members with Fixed Contract Rate of Delivery as set forth in Rate Schedule A, as the same may be modified from time to time by Seller’s Board of Directors, and on the same terms and conditions set forth in this Agreement. B. As stated in Seller’s Board Policy 10 (R04.08-15-17) adopted at the August 2017 Board meeting, “Rate Development Policy for Different Wholesale Power Contract Terms”, Seller’s Class A Member rate components shall be developed under this Agreement based on recovering depreciation expense on those Applicable Generation Assets over the term of the 2050 Contracts as such terms are defined pursuant to Board Policy 10 (R04.08-15-17). In addition, should Tri-State and Seller wish to extTermination the term of this Agreement, depreciation expense 2 for purposes of setting the Tri-State rate will be calculated as set forth in Board Policy 10 (R04.08-15-17). Any changes to said Board Policy 10 (R04.08-15-17) affecting the Class A Member rate paid by Tri-State pursuant to this Agreement shall not apply to the rates charged under this Agreement unless expressly agreed to in writing by Tri-State. C. Seller’s Board of Directors, at such intervals as it shall deem appropriate but in any event not less frequently than once in each calTerminationar year, shall review the rate for electric power and energy furnished hereunder and under similar contracts with Seller’s other members and, if necessary, shall revise such rate so that it shall produce revenues which shall be sufficient, but only sufficient, with the revenues of Seller from all other sources, to meet the cost of the operation and maintenance (including, without limitation, replacement, insurance, taxes and administrative and general overhead expenses) of the generating plants, the transmission system and related facilities of Seller, the cost of any power and energy purchased for resale hereunder by Seller, the cost of transmission service, the cost of lease payments, interest expense and depreciation expense or principal repayments of Seller, and to provide for the establishment and maintenance of reasonable reserves. Seller shall cause a notice in writing to be given to Tri-State and other members of Seller which shall set out the proposed revisions of rate with the effective date thereof, which shall not be less than thirty (30) days\n                 after the date of the notice, and shall set forth the basis upon which the rate is proposed to be adjusted and established. Subject to Section 4(B), Tri-State agrees that the rate from time to time established by Seller’s Board of Directors shall be deemed to be substituted for the rate herein provided and agrees to pay for electric power and energy furnished by Seller to it hereunder after the effective date of any such revision at such revised rates. 5. Bill Calculation and Payment of Bills. A. Notwithstanding anything to the contrary within the Seller’s Rate Schedule A, the monthly demand charge shall be the demand rate multiplied by the billing demand. The billing demand shall be the maximum hourly delivery shown in each Exhibit A and Exhibit B individually for the given month. The monthly energy charge will be similarly determined by the energy amounts in each Exhibit A and Exhibit B individually summated for the days in the given month as delivered and received, multiplied by the energy rate; and any damages pursuant to Section 7(C) or (D). Billed demand and energy shall be based on Mountain Standard Time. B. Bills for the electric power and energy furnished hereunder shall be rTerminationered to Tri\n                -\n                State pursuant to the Operating Procedures authorized in Section 10. Tri- State shall pay for electric power and energy furnished hereunder by immediately available funds, to the Seller’s account, as directed, monthly within fifteen (15) days after the bill is delivered to Tri-State at the address specified by Tri-State in the Operating Procedures. Payments not received by the Seller from Tri-State within twenty (20) calTerminationar days following the delivery of the bill to Tri-State will be 3 assessed an interest charge in accordance with the terms of the Seller’s policy on late payment of power bills as described within Seller’s Class A Member Rate Schedule A. If there is a dispute between Seller and Tri\n                -\n                State over the amount due under any power bill, Tri-State shall nevertheless pay the full amount billed by Seller and then proceed to resolve the dispute in any manner available to it under this Agreement or law. In the event the Seller shall be found to have charged in excess of that properly chargeable hereunder, the Seller shall refund such amount, together with interest, at a rate equal to the interest rate charged by Seller on late payment of power bills. If Tri-State shall fail to pay any such bill within fifteen (15) days after the bill is delivered, the Seller may discontinue delivery of electric power and energy hereunder upon fifteen (15) days written notice to Tri- State of its intention to do so. 6. Patronage. Patronage from Seller shall be based upon all revenue received from Tri\n                - State pursuant to this Agreement and the Eastern Interconnection Wholesale Power Contract. 7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Purchase and Sale",
      "tags": [
        "transmission",
        "termination",
        "crod",
        "patronage",
        "point_of_delivery",
        "assignment",
        "curtailment",
        "liquidated_damages",
        "delivery",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "Bill Calculation",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Transmission Service",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Different Wholesale",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "Power Contract",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "Contract Rate",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Delivery Points",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "Board Policy",
        "Rate Development",
        "JUL",
        "WPC",
        "Rate Schedule",
        "MAR",
        "Western Interconnection",
        "Electric Characteristics",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "Applicable Generation",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "CROD",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "4",
      "title": "Electric Characteristics",
      "text": "2. Electric Characteristics. A. Firm electric power and energy to be furnished hereunder shall be alternating current, three-phase, sixty (60) cycle. B. Contingency reserves, including operating, spinning and frequency responsive, shall be included with this purchase of electric power and energy. C. Scheduling practices shall comply with the policies of the applicable regional reliability organization(s), balancing area authority, and transmission provider’s open access transmission tariff(s), having such jurisdiction. 3. Transmission Service. A. Seller shall bear the sole responsibility to obtain and pay all costs of transmission of electric power and energy from Seller’s generation and purchased power resources to the Points of Delivery specified in Exhibit A and Exhibit B. This shall include, but not be limited to, losses and ancillary service charges. B. Tri-State shall have the sole responsibility to obtain and pay all costs of transmission service beyond the Points of Delivery. 4. Rate. A. Tri-State shall pay Seller for all electric power and energy furnished hereunder at the Seller’s Class A Member rate for members with Fixed Contract Rate of Delivery as set forth in Rate Schedule A, as the same may be modified from time to time by Seller’s Board of Directors, and on the same terms and conditions set forth in this Agreement. B. As stated in Seller’s Board Policy 10 (R04.08-15-17) adopted at the August 2017 Board meeting, “Rate Development Policy for Different Wholesale Power Contract Terms”, Seller’s Class A Member rate components shall be developed under this Agreement based on recovering depreciation expense on those Applicable Generation Assets over the term of the 2050 Contracts as such terms are defined pursuant to Board Policy 10 (R04.08-15-17). In addition, should Tri-State and Seller wish to extTermination the term of this Agreement, depreciation expense 2 for purposes of setting the Tri-State rate will be calculated as set forth in Board Policy 10 (R04.08-15-17). Any changes to said Board Policy 10 (R04.08-15-17) affecting the Class A Member rate paid by Tri-State pursuant to this Agreement shall not apply to the rates charged under this Agreement unless expressly agreed to in writing by Tri-State. C. Seller’s Board of Directors, at such intervals as it shall deem appropriate but in any event not less frequently than once in each calTerminationar year, shall review the rate for electric power and energy furnished hereunder and under similar contracts with Seller’s other members and, if necessary, shall revise such rate so that it shall produce revenues which shall be sufficient, but only sufficient, with the revenues of Seller from all other sources, to meet the cost of the operation and maintenance (including, without limitation, replacement, insurance, taxes and administrative and general overhead expenses) of the generating plants, the transmission system and related facilities of Seller, the cost of any power and energy purchased for resale hereunder by Seller, the cost of transmission service, the cost of lease payments, interest expense and depreciation expense or principal repayments of Seller, and to provide for the establishment and maintenance of reasonable reserves. Seller shall cause a notice in writing to be given to Tri-State and other members of Seller which shall set out the proposed revisions of rate with the effective date thereof, which shall not be less than thirty (30) days\n                 after the date of the notice, and shall set forth the basis upon which the rate is proposed to be adjusted and established. Subject to Section 4(B), Tri-State agrees that the rate from time to time established by Seller’s Board of Directors shall be deemed to be substituted for the rate herein provided and agrees to pay for electric power and energy furnished by Seller to it hereunder after the effective date of any such revision at such revised rates. 5. Bill Calculation and Payment of Bills. A. Notwithstanding anything to the contrary within the Seller’s Rate Schedule A, the monthly demand charge shall be the demand rate multiplied by the billing demand. The billing demand shall be the maximum hourly delivery shown in each Exhibit A and Exhibit B individually for the given month. The monthly energy charge will be similarly determined by the energy amounts in each Exhibit A and Exhibit B individually summated for the days in the given month as delivered and received, multiplied by the energy rate; and any damages pursuant to Section 7(C) or (D). Billed demand and energy shall be based on Mountain Standard Time. B. Bills for the electric power and energy furnished hereunder shall be rTerminationered to Tri\n                -\n                State pursuant to the Operating Procedures authorized in Section 10. Tri- State shall pay for electric power and energy furnished hereunder by immediately available funds, to the Seller’s account, as directed, monthly within fifteen (15) days after the bill is delivered to Tri-State at the address specified by Tri-State in the Operating Procedures. Payments not received by the Seller from Tri-State within twenty (20) calTerminationar days following the delivery of the bill to Tri-State will be 3 assessed an interest charge in accordance with the terms of the Seller’s policy on late payment of power bills as described within Seller’s Class A Member Rate Schedule A. If there is a dispute between Seller and Tri\n                -\n                State over the amount due under any power bill, Tri-State shall nevertheless pay the full amount billed by Seller and then proceed to resolve the dispute in any manner available to it under this Agreement or law. In the event the Seller shall be found to have charged in excess of that properly chargeable hereunder, the Seller shall refund such amount, together with interest, at a rate equal to the interest rate charged by Seller on late payment of power bills. If Tri-State shall fail to pay any such bill within fifteen (15) days after the bill is delivered, the Seller may discontinue delivery of electric power and energy hereunder upon fifteen (15) days written notice to Tri- State of its intention to do so. 6. Patronage. Patronage from Seller shall be based upon all revenue received from Tri\n                - State pursuant to this Agreement and the Eastern Interconnection Wholesale Power Contract. 7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "transmission",
        "crod",
        "patronage",
        "liquidated_damages",
        "assignment",
        "curtailment",
        "termination",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "Bill Calculation",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Transmission Service",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Different Wholesale",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "Power Contract",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "Board Policy",
        "Rate Development",
        "JUL",
        "WPC",
        "Rate Schedule",
        "MAR",
        "Electric Characteristics",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "Applicable Generation",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "5",
      "title": "Transmission Service",
      "text": "3. Transmission Service. A. Seller shall bear the sole responsibility to obtain and pay all costs of transmission of electric power and energy from Seller’s generation and purchased power resources to the Points of Delivery specified in Exhibit A and Exhibit B. This shall include, but not be limited to, losses and ancillary service charges. B. Tri-State shall have the sole responsibility to obtain and pay all costs of transmission service beyond the Points of Delivery. 4. Rate. A. Tri-State shall pay Seller for all electric power and energy furnished hereunder at the Seller’s Class A Member rate for members with Fixed Contract Rate of Delivery as set forth in Rate Schedule A, as the same may be modified from time to time by Seller’s Board of Directors, and on the same terms and conditions set forth in this Agreement. B. As stated in Seller’s Board Policy 10 (R04.08-15-17) adopted at the August 2017 Board meeting, “Rate Development Policy for Different Wholesale Power Contract Terms”, Seller’s Class A Member rate components shall be developed under this Agreement based on recovering depreciation expense on those Applicable Generation Assets over the term of the 2050 Contracts as such terms are defined pursuant to Board Policy 10 (R04.08-15-17). In addition, should Tri-State and Seller wish to extTermination the term of this Agreement, depreciation expense 2 for purposes of setting the Tri-State rate will be calculated as set forth in Board Policy 10 (R04.08-15-17). Any changes to said Board Policy 10 (R04.08-15-17) affecting the Class A Member rate paid by Tri-State pursuant to this Agreement shall not apply to the rates charged under this Agreement unless expressly agreed to in writing by Tri-State. C. Seller’s Board of Directors, at such intervals as it shall deem appropriate but in any event not less frequently than once in each calTerminationar year, shall review the rate for electric power and energy furnished hereunder and under similar contracts with Seller’s other members and, if necessary, shall revise such rate so that it shall produce revenues which shall be sufficient, but only sufficient, with the revenues of Seller from all other sources, to meet the cost of the operation and maintenance (including, without limitation, replacement, insurance, taxes and administrative and general overhead expenses) of the generating plants, the transmission system and related facilities of Seller, the cost of any power and energy purchased for resale hereunder by Seller, the cost of transmission service, the cost of lease payments, interest expense and depreciation expense or principal repayments of Seller, and to provide for the establishment and maintenance of reasonable reserves. Seller shall cause a notice in writing to be given to Tri-State and other members of Seller which shall set out the proposed revisions of rate with the effective date thereof, which shall not be less than thirty (30) days\n                 after the date of the notice, and shall set forth the basis upon which the rate is proposed to be adjusted and established. Subject to Section 4(B), Tri-State agrees that the rate from time to time established by Seller’s Board of Directors shall be deemed to be substituted for the rate herein provided and agrees to pay for electric power and energy furnished by Seller to it hereunder after the effective date of any such revision at such revised rates. 5. Bill Calculation and Payment of Bills. A. Notwithstanding anything to the contrary within the Seller’s Rate Schedule A, the monthly demand charge shall be the demand rate multiplied by the billing demand. The billing demand shall be the maximum hourly delivery shown in each Exhibit A and Exhibit B individually for the given month. The monthly energy charge will be similarly determined by the energy amounts in each Exhibit A and Exhibit B individually summated for the days in the given month as delivered and received, multiplied by the energy rate; and any damages pursuant to Section 7(C) or (D). Billed demand and energy shall be based on Mountain Standard Time. B. Bills for the electric power and energy furnished hereunder shall be rTerminationered to Tri\n                -\n                State pursuant to the Operating Procedures authorized in Section 10. Tri- State shall pay for electric power and energy furnished hereunder by immediately available funds, to the Seller’s account, as directed, monthly within fifteen (15) days after the bill is delivered to Tri-State at the address specified by Tri-State in the Operating Procedures. Payments not received by the Seller from Tri-State within twenty (20) calTerminationar days following the delivery of the bill to Tri-State will be 3 assessed an interest charge in accordance with the terms of the Seller’s policy on late payment of power bills as described within Seller’s Class A Member Rate Schedule A. If there is a dispute between Seller and Tri\n                -\n                State over the amount due under any power bill, Tri-State shall nevertheless pay the full amount billed by Seller and then proceed to resolve the dispute in any manner available to it under this Agreement or law. In the event the Seller shall be found to have charged in excess of that properly chargeable hereunder, the Seller shall refund such amount, together with interest, at a rate equal to the interest rate charged by Seller on late payment of power bills. If Tri-State shall fail to pay any such bill within fifteen (15) days after the bill is delivered, the Seller may discontinue delivery of electric power and energy hereunder upon fifteen (15) days written notice to Tri- State of its intention to do so. 6. Patronage. Patronage from Seller shall be based upon all revenue received from Tri\n                - State pursuant to this Agreement and the Eastern Interconnection Wholesale Power Contract. 7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Covenants",
      "tags": [
        "transmission",
        "crod",
        "patronage",
        "liquidated_damages",
        "assignment",
        "curtailment",
        "termination",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "Bill Calculation",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Transmission Service",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Different Wholesale",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "Power Contract",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "Board Policy",
        "Rate Development",
        "JUL",
        "WPC",
        "Rate Schedule",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "Applicable Generation",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "6",
      "title": "Rate",
      "text": "4. Rate. A. Tri-State shall pay Seller for all electric power and energy furnished hereunder at the Seller’s Class A Member rate for members with Fixed Contract Rate of Delivery as set forth in Rate Schedule A, as the same may be modified from time to time by Seller’s Board of Directors, and on the same terms and conditions set forth in this Agreement. B. As stated in Seller’s Board Policy 10 (R04.08-15-17) adopted at the August 2017 Board meeting, “Rate Development Policy for Different Wholesale Power Contract Terms”, Seller’s Class A Member rate components shall be developed under this Agreement based on recovering depreciation expense on those Applicable Generation Assets over the term of the 2050 Contracts as such terms are defined pursuant to Board Policy 10 (R04.08-15-17). In addition, should Tri-State and Seller wish to extTermination the term of this Agreement, depreciation expense 2 for purposes of setting the Tri-State rate will be calculated as set forth in Board Policy 10 (R04.08-15-17). Any changes to said Board Policy 10 (R04.08-15-17) affecting the Class A Member rate paid by Tri-State pursuant to this Agreement shall not apply to the rates charged under this Agreement unless expressly agreed to in writing by Tri-State. C. Seller’s Board of Directors, at such intervals as it shall deem appropriate but in any event not less frequently than once in each calTerminationar year, shall review the rate for electric power and energy furnished hereunder and under similar contracts with Seller’s other members and, if necessary, shall revise such rate so that it shall produce revenues which shall be sufficient, but only sufficient, with the revenues of Seller from all other sources, to meet the cost of the operation and maintenance (including, without limitation, replacement, insurance, taxes and administrative and general overhead expenses) of the generating plants, the transmission system and related facilities of Seller, the cost of any power and energy purchased for resale hereunder by Seller, the cost of transmission service, the cost of lease payments, interest expense and depreciation expense or principal repayments of Seller, and to provide for the establishment and maintenance of reasonable reserves. Seller shall cause a notice in writing to be given to Tri-State and other members of Seller which shall set out the proposed revisions of rate with the effective date thereof, which shall not be less than thirty (30) days\n                 after the date of the notice, and shall set forth the basis upon which the rate is proposed to be adjusted and established. Subject to Section 4(B), Tri-State agrees that the rate from time to time established by Seller’s Board of Directors shall be deemed to be substituted for the rate herein provided and agrees to pay for electric power and energy furnished by Seller to it hereunder after the effective date of any such revision at such revised rates. 5. Bill Calculation and Payment of Bills. A. Notwithstanding anything to the contrary within the Seller’s Rate Schedule A, the monthly demand charge shall be the demand rate multiplied by the billing demand. The billing demand shall be the maximum hourly delivery shown in each Exhibit A and Exhibit B individually for the given month. The monthly energy charge will be similarly determined by the energy amounts in each Exhibit A and Exhibit B individually summated for the days in the given month as delivered and received, multiplied by the energy rate; and any damages pursuant to Section 7(C) or (D). Billed demand and energy shall be based on Mountain Standard Time. B. Bills for the electric power and energy furnished hereunder shall be rTerminationered to Tri\n                -\n                State pursuant to the Operating Procedures authorized in Section 10. Tri- State shall pay for electric power and energy furnished hereunder by immediately available funds, to the Seller’s account, as directed, monthly within fifteen (15) days after the bill is delivered to Tri-State at the address specified by Tri-State in the Operating Procedures. Payments not received by the Seller from Tri-State within twenty (20) calTerminationar days following the delivery of the bill to Tri-State will be 3 assessed an interest charge in accordance with the terms of the Seller’s policy on late payment of power bills as described within Seller’s Class A Member Rate Schedule A. If there is a dispute between Seller and Tri\n                -\n                State over the amount due under any power bill, Tri-State shall nevertheless pay the full amount billed by Seller and then proceed to resolve the dispute in any manner available to it under this Agreement or law. In the event the Seller shall be found to have charged in excess of that properly chargeable hereunder, the Seller shall refund such amount, together with interest, at a rate equal to the interest rate charged by Seller on late payment of power bills. If Tri-State shall fail to pay any such bill within fifteen (15) days after the bill is delivered, the Seller may discontinue delivery of electric power and energy hereunder upon fifteen (15) days written notice to Tri- State of its intention to do so. 6. Patronage. Patronage from Seller shall be based upon all revenue received from Tri\n                - State pursuant to this Agreement and the Eastern Interconnection Wholesale Power Contract. 7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Price",
      "tags": [
        "transmission",
        "termination",
        "crod",
        "patronage",
        "assignment",
        "pricing",
        "curtailment",
        "liquidated_damages",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "Bill Calculation",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Different Wholesale",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "Power Contract",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "Board Policy",
        "Rate Development",
        "JUL",
        "WPC",
        "Rate Schedule",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "Applicable Generation",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "7",
      "title": "Patronage",
      "text": "6. Patronage. Patronage from Seller shall be based upon all revenue received from Tri\n                - State pursuant to this Agreement and the Eastern Interconnection Wholesale Power Contract. 7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "transmission",
        "crod",
        "patronage",
        "liquidated_damages",
        "assignment",
        "curtailment",
        "termination",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "8",
      "title": "Continuity Of Service",
      "text": "7. Continuity of Service. A. Seller shall use reasonable diligence to provide a constant and uninterrupted supply of electric power and energy hereunder. Subject to the foregoing, if the supply of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of the Seller, the Seller shall not be liable therefore or for damages caused thereby. B. Tri-State shall use reasonable diligence to provide constant and uninterrupted receipt of the supply of electric power and energy hereunder. Subject to the foregoing, if the receipt of electric power and energy shall fail or be interrupted, or become defective through an Force Majeure or of the public enemy, or caused by accident, catastrophic failure in the transmission system, labor troubles, or any other cause beyond the control of Tri-State, Tri-State shall not be liable therefore or for damages caused thereby. C. Liquidated damages for Curtailments by Seller. If Seller curtails energy deliveries to Tri-State, and such curtailment is not excused for reasons stated in Section 7(A), Seller shall be liable to Tri-State for the difference between (if positive) (replacement energy price – contract energy price) (a) the price at which Tri-State, acting in a commercially reasonable manner, effects a purchase of substitute energy, or absent such purchase, the market price for such quantity of energy, as determined by Tri-State in a commercially reasonable manner, at the applicable Point(s) of Delivery and (b) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery, multiplied by the quantity of energy curtailed. 4 D. Liquidated damages for Curtailments by Tri-State. If Tri-State curtails the receipt of energy deliveries from Seller, and such curtailment is not excused for reasons stated in Section 7(B), Tri-State shall be liable to Seller for the difference between (if positive) (contract energy price – resale energy price) (a) the price of energy set forth in Seller’s Class A Member Rate Schedule A for members with Fixed Contract Rate of Delivery and (b) the price at which Seller, acting in a commercially reasonable manner, effects a resale of the energy not received by Tri-State or, absent such resale, the market price of such energy, as determined by Seller in a commercially reasonable manner at the applicable Point(s) of Delivery, multiplied by the quantity of energy curtailed. 8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Covenants",
      "tags": [
        "transmission",
        "crod",
        "liquidated_damages",
        "assignment",
        "curtailment",
        "termination",
        "force_majeure"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "If Seller",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "If Tri",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "Fixed Contract",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "Member Rate",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "9",
      "title": "Transfer By Tri-State",
      "text": "8. Assignment by Tri-State. Tri-State shall not without the approval in writing of Seller, which approval shall not be unreasonably withheld, delayed, or conditioned, take or suffer to be taken any steps for reorganization or to consolidate with or merge into any organization. Notwithstanding the foregoing, Tri-State may take or suffer to be taken any steps for reorganization or to consolidate with or merge into any corporation, so long as Tri-State shall pay such pro rata portion of the outstanding indebtedness, as well as other obligations and commitments of Seller at the time existing, as shall be determined by Seller and shall otherwise comply with such reasonable terms and conditions as Seller shall require. Notwithstanding the foregoing, no such approval shall be required to take the actions contemplated herein so long as the purchaser or surviving organization is a member of Seller and has validly authorized, executed and delivered a contract for electric service substantially in the form of this Agreement. 9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod",
        "assignment"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "10",
      "title": "Specific Performance",
      "text": "9. Specific Performance. Seller and Tri-State agree that the failure or threatened failure of Tri-State to comply with the terms of Section 8 will cause irreparable injury to Seller which cannot properly or adequately be compensated by the mere payment of damages. Tri-State agrees, therefore, that in the event of a breach or threatened breach by Tri-State of Section 8, that Seller, in addition to any other remedies that may be available to it judicially, shall have the right to obtain from any competent court a decree enjoining such breach or threatened breach of Section 8 and providing for the terms of said Section to be specifically enforced. 10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod",
        "assignment"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Specific Performance",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "11",
      "title": "Operating Representatives",
      "text": "10. Operating Representatives. The Parties hereby establish an operating committee consisting of one representative from each Party authorized to act on its behalf (“Operating Representative”) to secure effective coordination and to deal on a prompt and orderly basis with the various operating and technical issues which arise in conjunction with the obligations of the Parties hereunder, including the development of operating procedures or practices. The establishment of any procedure or practice and any other action or determination by the Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod",
        "assignment"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "12",
      "title": "Operating Representatives",
      "text": "Operating Representatives shall be effective when signed by the Operating Representative of each of the Parties. The Operating Representatives of the Parties shall have no authority to modify any provision of this Agreement. The Operating Representatives of the Parties are as follows: 5 Seller: Ms. Becky Kern, Director of Utility Planning 1717 E. Interstate Avenue Bismarck, ND 58503 Office: Email: Tri-State: Attn: Dan Walter, Senior Manager Energy Markets 1100 W. 116th Avenue Westminster, CO 80234 Office: Email: The designation of the Operating Representative or their address may be changed at any time by providing such notice to the other Party. 11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod",
        "assignment"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "Becky Kern",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "Operating Representative",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Operating Representatives",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Dan Walter",
        "Senior Vice",
        "NOV",
        "The Operating",
        "Effective Date",
        "Avenue Westminster",
        "Assistant Secretary",
        "TRI",
        "Utility Planning",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "Energy Markets",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "Senior Manager",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "13",
      "title": "Assignments",
      "text": "11. Assignments. Except as provided below, neither Party shall assign any of its rights, title or interest or delegate any of its performance under this Agreement, without the prior written consent of the other Party, which consent shall not be unreasonably withheld or delayed. Either Party shall have the right at any time and from time to time to mortgage, create or provide for a security interest in or convey in trust their respective rights, titles and interests in this Agreement to a lTerminationer, mortgagee or trustee under a deed of trust, mortgage or indenture, or to secured parties\n                 under a security agreement, as security for its present or future notes, bonds or other obligations or securities, and to any successors or assigns thereof without need for the prior consent of the other Party, and without such lTerminationer, mortgagee, trustee or secured party assuming or becoming in any respect obligated to perform any of the obligations of the Party. Any lTerminationer, mortgagee, trustee or secured party under a present or future deed of trust, mortgage, indenture or security agreement of either Party and any successor thereof by action of law or otherwise, and any purchaser, Assignmentee or assignee of any thereof may, without need for the prior consent of the other Party, succeed to and acquire all the rights, titles and interests of such Party in this Agreement, and may foreclose upon said rights, titles and interests of such Party. Any purported assignment in violation of this section is void. Subject to the foregoing, this Agreement is binding upon and inures to the benefit of the Parties and their permitted successors and assigns. 12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Miscellaneous",
      "tags": [
        "termination",
        "transmission",
        "crod",
        "assignment"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Either Party",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Senior Vice",
        "NOV",
        "Effective Date",
        "Assistant Secretary",
        "TRI",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "14",
      "title": "Term",
      "text": "12. Term. This Agreement is effective and deliveries under this Agreement will begin on the Effective Date. This Agreement shall remain in effect until December 31, 2050. If either Party desires to terminate this Agreement on December 31, 2050, it shall provide written notice of intent to terminate by January 1, 2045. If notice of termination is not received by either Party prior to January 1, 2045, this Agreement shall remain in effect unless terminated by either Party giving to the other Party not less than five (5) years prior written notice of its intention to terminate. As of the Effective Date, the Former WPC shall be amTerminationed and restated in its entirety by this Agreement and the Eastern Interconnection Wholesale Power Contract. 6 13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Termination",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Senior Vice",
        "NOV",
        "Effective Date",
        "Assistant Secretary",
        "TRI",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "WPC",
        "MAR",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "15",
      "title": "Notice",
      "text": "13. Notice. Any notice, consent or other communication required to be made in writing under this Agreement including among other things billings and invoices shall be sent by (i) personal delivery; (ii) certified mail (postage prepaid, return receipt requested); (iii) nationally recognized overnight courier service (charges prepaid and with signature required upon receipt), or (iv) electronic mail, in each case properly addressed to the persons specified below. Notices, consents and other communications sent in accordance with this Section are deemed delivered on the sent date of the electronic mail, the date of actual delivery or date of delivery refusal. Any Party may from time to time change its contact information by sTerminationing a notice in accordance with this Section. Notices shall be addressed as follows: To Seller: Basin Electric Power Cooperative Attention: CEO & General Manager 1717 E. Interstate Avenue Bismarck, ND 58503 With a copy to Seller at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. To Tri-State: Attn: Chief Executive Officer Tri-State Generation and Transmission Association, Inc. 1100 W. 116th Ave. Westminster, CO 80234 With a copy to Tri-State at the same address above: Attn: Senior Vice President and General Counsel Billings and Invoices: Refer to Operating Procedures. 14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Notices",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "Officer Tri",
        "COOPERATIVE",
        "STATE",
        "POINT",
        "Officer Date",
        "ND",
        "Sukut Name",
        "STEGALL",
        "THE",
        "Governing Law",
        "Eastern Interconnection",
        "SEP",
        "INTERCONNECTION",
        "To Tri",
        "RATE",
        "Any Party",
        "MW",
        "JAN",
        "CONTRACT",
        "ASSOCIATION",
        "Reif Name",
        "Interstate Avenue",
        "Chief Executive",
        "IN",
        "Transmission Association",
        "OCT",
        "AULT",
        "BUSSES",
        "General Counsel",
        "TRANSMISSION",
        "FOR",
        "BUS",
        "POWER",
        "ELECTRIC",
        "OF",
        "WESTERN",
        "AUG",
        "MAY",
        "This Agreement",
        "WHEREOF",
        "Senior Vice",
        "NOV",
        "Assistant Secretary",
        "TRI",
        "General Manager",
        "FEB",
        "Reif Title",
        "Power Cooperative",
        "ATTEST",
        "Foss Name",
        "TO",
        "CO",
        "Basin Electric",
        "The Parties",
        "GENERATION",
        "Wholesale Power",
        "Sukut Title",
        "JUN",
        "AND",
        "JUL",
        "MAR",
        "State Generation",
        "HE",
        "WEST",
        "BASIN",
        "WITNESS",
        "To Seller",
        "DELIVERY",
        "SVP",
        "STORY",
        "WHOLESALE",
        "DEC",
        "EXHIBIT",
        "CEO",
        "APR",
        "Foss Title",
        "Mountain Standard",
        "Operating Procedures",
        "INC",
        "Entire Agreement"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "16",
      "title": "Variations In Writing",
      "text": "14. Variations in Writing. All additions, amTerminationments or variations to this Agreement shall be binding only if in writing and signed by duly authorized representatives of both Parties. 15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "Entire Agreement",
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "Governing Law",
        "The Parties",
        "GENERATION",
        "DEC",
        "POWER",
        "Eastern Interconnection",
        "Wholesale Power",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "17",
      "title": "Governing Law",
      "text": "15. Governing Law. The rights and obligations of the Parties under or pursuant to this Agreement shall be governed by and construed according to the laws of the state of Colorado without respect to that state’s conflict of law principles. 16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Governing Law",
      "tags": [
        "termination",
        "transmission",
        "governing_law",
        "crod"
      ],
      "definitions": [
        "Entire Agreement",
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "Governing Law",
        "The Parties",
        "GENERATION",
        "DEC",
        "POWER",
        "Eastern Interconnection",
        "Wholesale Power",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "18",
      "title": "Entire Agreement",
      "text": "16. Entire Agreement. This Agreement constitutes the entire agreement between Seller and Tri-State regarding matters addressed herein and supersedes all prior written and oral communications and understandings in connection therewith. The Parties acknowledge that certain sales by Seller to Tri-State on the Eastern Interconnection shall be governed by the Eastern Interconnection Wholesale Power Contract. 7 17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "Entire Agreement",
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "The Parties",
        "GENERATION",
        "DEC",
        "POWER",
        "Eastern Interconnection",
        "Wholesale Power",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "19",
      "title": "Waiver",
      "text": "17. Waiver. The delay or failure of either Party to enforce or insist upon compliance with or strict performance of any of the terms or conditions of this Agreement, or to exercise or take advantage of any of its rights, including any right to terminate this Agreement, shall not constitute a waiver or relinquishment of any such terms, conditions or rights, but the same shall be and remain at all times in full force and effect. 18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "GENERATION",
        "DEC",
        "POWER",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "20",
      "title": "Audit",
      "text": "18. Audit. During the term of this Agreement and for a period of three (3) years after Termination of this Agreement, each Party shall have the right, at its sole expense, with reasonable advance written notice and during normal working hours, to examine the records of the other Party to the extent reasonably necessary to verify the accuracy of any billing or invoice statement, charge or computation made pursuant to this Agreement. 19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Covenants",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "GENERATION",
        "DEC",
        "POWER",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "21",
      "title": "Severability",
      "text": "19. Severability. In the event any of the terms, covenants or conditions of this Agreement, its Exhibit(s) or the application of any such terms, covenants or conditions shall be held invalid, illegal or unenforceable by any court or administrative body having jurisdiction, all other terms, covenants and conditions of this Agreement and their application not adversely affected thereby shall remain in force and effect; provided, however, that Seller and Tri-State shall negotiate in good faith to attempt to implement an equitable adjustment in the provisions of this Agreement with a view toward effecting the purposes of this Agreement by replacing the provision that is held invalid, illegal or unenforceable with a valid provision the economic effect of which comes as close as possible to that of the provision that has been found to be invalid, illegal or unenforceable. 20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "GENERATION",
        "DEC",
        "POWER",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "22",
      "title": "Counterparts",
      "text": "20. Counterparts. This Agreement may be executed in any number of counterparts, and each executed counterpart shall have the same force and effect as an original instrument. 21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "GENERATION",
        "DEC",
        "POWER",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "This Agreement",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    },
    {
      "id": "23",
      "title": "Captions",
      "text": "21. Captions. The captions used in this Agreement are for ease of reference only and do not constitute a part of this Agreement. IN WITNESS WHEREOF, the Parties have caused this Agreement to be executed by their duly authorized officers or representatives as of the dates indicated below. 8 ATTEST By: /s/ Mark D. Foss Name: Mark D. Foss Title: Assistant Secretary Date: September 11, 2017 BASIN ELECTRIC POWER COOPERATIVE By: /s/ Paul M. Sukut Name: Paul M. Sukut Title: CEO & General Manager Date: September 11, 2017 ATTEST By: /s/ Kenneth V. Reif Name: Kenneth V. Reif Title: SVP/General Counsel Date: September 27, 2017 TRI-STATE GENERATION AND TRANSMISSION ASSOCIATION, INC. By: /s/ Michael S. McInnes Name: Micheal S. McInnes Title: Chief Executive Officer Date: September 27, 2017 9 WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT A CONTRACT RATE OF DELIVERY TO STEGALL WEST POINT OF DELIVERY: STEGALL WEST 230KV BUS Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 JAN 73 71 72 71 74 75 84 92 91 88 86 85 82 81 79 80 86 94 97 95 94 90 85 FEB 73 72 72 72 74 81 85 91 90 89 88 86 83 82 81 81 85 89 97 96 94 91 85 MAR 69 67 68 68 72 76 83 82 82 81 80 77 75 75 74 74 75 79 84 84 84 80 74 APR 48 46 46 46 47 51 56 57 58 58 58 55 55 54 54 54 55 56 58 59 60 58 53 MAY 54 52 51 51 52 55 61 63 65 65 65 65 65 65 65 65 67 67 67 68 68 67 63 JUN 80 75 73 72 73 76 81 93 98 100 102 105 105 106 106 107 107 108 107 108 107 107 100 JUL 89 85 84 83 83 84 88 99 104 108 112 114 115 117 118 119 119 119 118 118 115 115 107 AUG 88 85 84 83 83 85 90 99 104 107 110 112 113 114 115 117 117 117 117 117 117 113 104 SEP 54 53 52 51 52 55 61 70 71 73 73 74 74 74 76 76 76 78 79 81 81 76 69 OCT 55 52 51 51 52 55 60 69 71 72 72 70 68 68 69 70 72 73 73 73 73 70 67 NOV 67 67 67 67 70 74 78 81 81 82 80 77 76 75 74 76 80 85 86 85 84 80 75 DEC 72 72 72 72 73 76 84 90 90 89 87 85 83 81 80 87 93 99 100 99 97 94 87 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time WHOLESALE POWER CONTRACT FOR THE WESTERN INTERCONNECTION EXHIBIT B CONTRACT RATE OF DELIVERY TO AULT/STORY POINT OF DELIVERY: AULT 230KV and STORY 230KV BUSSES Month \\HE 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 JAN 92 90 90 90 93 95 105 115 114 111 109 107 103 102 99 100 108 118 122 119 118 114 106 95 FEB 91 90 90 90 93 102 107 114 114 112 110 108 104 103 102 102 106 112 122 121 119 114 107 93 MAR 86 85 85 86 90 96 104 104 104 102 100 96 94 94 94 94 94 100 105 106 105 100 93 87 APR 60 58 57 57 59 64 70 72 72 72 72 70 69 68 67 67 69 71 72 73 75 73 66 61 MAY 67 65 64 64 65 70 76 80 81 82 82 82 82 82 82 82 85 85 85 85 85 84 80 72 JUN 100 95 92 92 92 96 102 118 123 126 130 131 132 133 133 135 136 136 136 136 136 134 126 110 JUL 111 107 106 104 104 106 110 123 130 135 140 143 145 146 148 149 149 149 148 148 145 144 135 117 AUG 110 107 106 104 105 107 111 124 129 135 137 140 142 143 145 146 146 146 146 146 146 140 130 115 SEP 68 66 64 64 65 69 76 88 90 91 92 93 93 93 95 95 96 98 98 102 102 95 85 70 OCT 68 65 64 64 65 69 76 86 89 90 90 88 85 85 86 88 90 92 92 92 91 88 84 69 NOV 84 83 83 83 87 93 98 102 102 102 100 97 95 93 93 96 99 106 108 106 104 100 94 87 DEC 90 90 89 89 91 96 105 113 113 111 108 106 103 102 100 108 117 123 125 124 122 118 109 95 Amounts shown in MW, hours shown are Hour-Terminationing and in Mountain Standard Time",
      "clause_type": "Other",
      "tags": [
        "termination",
        "transmission",
        "crod"
      ],
      "definitions": [
        "IN",
        "General Manager",
        "COOPERATIVE",
        "HE",
        "OCT",
        "FEB",
        "STATE",
        "AULT",
        "WEST",
        "BUSSES",
        "BASIN",
        "General Counsel",
        "WITNESS",
        "TRANSMISSION",
        "FOR",
        "POINT",
        "Officer Date",
        "Reif Title",
        "DELIVERY",
        "Sukut Name",
        "ATTEST",
        "BUS",
        "Foss Name",
        "SVP",
        "TO",
        "STEGALL",
        "THE",
        "STORY",
        "WHOLESALE",
        "GENERATION",
        "DEC",
        "POWER",
        "ELECTRIC",
        "SEP",
        "OF",
        "INTERCONNECTION",
        "WESTERN",
        "EXHIBIT",
        "AUG",
        "RATE",
        "MAY",
        "Sukut Title",
        "WHEREOF",
        "CEO",
        "JUN",
        "AND",
        "APR",
        "MW",
        "JAN",
        "Foss Title",
        "Mountain Standard",
        "CONTRACT",
        "NOV",
        "ASSOCIATION",
        "Assistant Secretary",
        "TRI",
        "JUL",
        "INC",
        "Reif Name",
        "Chief Executive",
        "MAR"
      ],
      "parent_section": null,
      "page_number": null
    }
  ],
  "definitions": []
}